In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_excel(r'C:\Users\mohit\OneDrive\Desktop\Omdena-AI\omdena-texas-homelessness\src\data\income_related\Tx_LaborStats_2005-2021.xlsx')

In [3]:
df.head()

,Year,Period,Area,Area Type,Adjustment,Employment,Civilian Labor Force,Unemployment,Unemployment Rate
0,2005,March,Texas,Texas,Not Adjusted,10457456,11066337,608881,5.5
1,2005,March,Texas,Texas,Adjusted,10502785,11125846,623061,5.6
2,2005,June,Texas,Texas,Not Adjusted,10557049,11181612,624563,5.6
3,2005,June,Texas,Texas,Adjusted,10569961,11163389,593428,5.3
4,2005,September,Texas,Texas,Not Adjusted,10589753,11216770,627017,5.6

In [4]:
df.isnull().sum()

Year                    0
Period                  0
Area                    0
Area Type               0
Adjustment              0
Employment              0
Civilian Labor Force    0
Unemployment            0
Unemployment Rate       0
dtype: int64

In [5]:
df.nunique()

Year                       17
Period                      4
Area                      255
Area Type                   2
Adjustment                  2
Employment              12497
Civilian Labor Force    12675
Unemployment             4608
Unemployment Rate         180
dtype: int64

In [6]:
df.shape

(16896, 9)

In [7]:
n = int(0.1 * df.shape[0])

col = df.columns

for i in range(len(col)):
    if df[col[i]].nunique() > n:
        df.drop([col[i]] , axis=1, inplace=True)

In [8]:
df.shape

(16896, 6)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16896 entries, 0 to 16895
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               16896 non-null  int64
 1   Period             16896 non-null  object
 2   Area               16896 non-null  object
 3   Area Type          16896 non-null  object
 4   Adjustment         16896 non-null  object
 5   Unemployment Rate  16896 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 792.1+ KB

In [10]:
df.describe()

               Year  Unemployment Rate
count  16896.000000       16896.000000
mean    2012.757576           5.575112
std        4.767647           2.321590
min     2005.000000           0.700000
25%     2009.000000           3.975000
50%     2013.000000           5.000000
75%     2017.000000           6.700000
max     2021.000000          20.500000

In [11]:
df.head()

   Year     Period   Area Area Type    Adjustment  Unemployment Rate
0  2005      March  Texas     Texas  Not Adjusted                5.5
1  2005      March  Texas     Texas      Adjusted                5.6
2  2005       June  Texas     Texas  Not Adjusted                5.6
3  2005       June  Texas     Texas      Adjusted                5.3
4  2005  September  Texas     Texas  Not Adjusted                5.6

In [12]:
df.nunique()

Year                  17
Period                 4
Area                 255
Area Type              2
Adjustment             2
Unemployment Rate    180
dtype: int64

In [13]:
categorical_cols = ['Adjustment' , 'Area Type', 'Period',] 

from sklearn.preprocessing import LabelEncoder

# instantiate labelencoder object
le = LabelEncoder()

# apply le on categorical feature columns
for i in range(len(categorical_cols)):
    df[categorical_cols] = df[categorical_cols].apply(lambda col: le.fit_transform(col))
    
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()

#One-hot-encode the categorical columns.
#Unfortunately outputs an array instead of dataframe.
array_hot_encoded = ohe.fit_transform(df[categorical_cols])

#Convert it to df
data_hot_encoded = pd.DataFrame(array_hot_encoded, index=df.index)

#Extract only the columns that didnt need to be encoded
data_other_cols = df.drop(columns=categorical_cols)

#Concatenate the two dataframes : 
data_out = pd.concat([data_hot_encoded, data_other_cols], axis=1)

In [14]:
df.head()

   Year  Period   Area  Area Type  Adjustment  Unemployment Rate
0  2005       2  Texas          1           1                5.5
1  2005       2  Texas          1           0                5.6
2  2005       1  Texas          1           1                5.6
3  2005       1  Texas          1           0                5.3
4  2005       3  Texas          1           1                5.6

In [15]:
df.to_csv(r"C:\Users\mohit\OneDrive\Desktop\Omdena-AI\omdena-texas-homelessness\src\cleaned data\Labor_Stats_2005-2021.csv")